RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/Qk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/RANS";
    object      Qk;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    TOP
    {
        type            fixedValue;
        value           uniform 0;
    }
    BOTTOM
    {
        type            fixedValue;
        value           uniform 0;
    }
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }
}


// ************************************************************************* //
