RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (5e-5 0 0 5e-5 0 5e-5);

boundaryField
{
    BOTTOM
    {
     type            fixedValue;
     value           uniform (0 0 0 0 0 0);
    }

    INLET
    {
        type            cyclic;
    }

    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }   
    TOP 
    {
      type            fixedValue;
      value           uniform (0 0 0 0 0 0);
    } 
    OUTLET  
    {
        type            cyclic;
    }
}


// ************************************************************************* //
