RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/UEWA
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/RANS";
    object      UEWA;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.1335 0 0);

boundaryField
{
    BOTTOM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    INLET
    {
        type            cyclic;
    }

    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }   
    TOP 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    } 
    OUTLET  
    {
        type            cyclic;
    }
}

// ************************************************************************* //
