RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BOTTOM
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    INLET
    {
        type            cyclic;
    }
    LEFT
    {
        type            cyclic;
    }
     RIGHT
    {
        type            cyclic;
    }
    TOP
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    OUTLET
    {
        type            cyclic;
    }
   
}


// ************************************************************************* //
