RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    BOTTOM
    {
        type            zeroGradient;
    }

    INLET
    {
        type            cyclic;
    }

    LEFT
    {
        type            cyclic;
    }
    RIGHT
    {
        type            cyclic;
    }
    TOP
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            cyclic;
    }

}

// ************************************************************************* //
