RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/system/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//RASModel EBEVM;
//RASModel RefEBRSMEterm;
//RASModel EBRSMSebilleau;
//RASModel ManceauHanjalic;
RASModel RefEBRSM;       

turbulence      on;

printCoeffs     on;


RefEBRSMEtermCoeffs
{
    CmuKE           0.09;
    Clrr1           1.8;
    Clrr2           0.6;
    C1              1.44;
    C2              1.83;
    Cmu             0.07;
    sigmaEps        1.15;
    sigmaK          1.0;
    CL              0.133;
    CEta            80;
    yStarLim        5;
    implicitDiv     true;
    SSG             true;
    Cg1             3.4;
    Cg1s            1.8;
    Cg2             0;
    Cg3             0.8;
    Cg3s            1.3;
    Cg4             1.25;
    Cg5             0.4;
    crossTurbDiffusion false;
    CMu             0.21;
    CSEps           0.1826;
    CSR             0.21;
    SGDHEps         true;
    SGDHR           true; 
    A1p             0.065; 
    A1Eterm         0.085;
}


RefEBRSMCoeffs
{
    CmuKE           0.09;
    Clrr1           1.8;
    Clrr2           0.6;
    C1              1.44;
    C2              1.83;
    Cmu             0.07;
    sigmaEps        1.15;
    sigmaK          1.0;
    CL              0.133;
    CEta            80;
    yStarLim        5;
    implicitDiv     true;
    SSG             true;
    Cg1             3.4;
    Cg1s            1.8;
    Cg2             0;
    Cg3             0.8;
    Cg3s            1.3;
    Cg4             1.25;
    Cg5             0.4;
    crossTurbDiffusion true;
    CMu             0.21;
    CSEps           0.1826;
    CSR             0.21;
    SGDHEps         false;
    SGDHR           false;
    A1p             0.065;
}


EBRSMSebilleauCoeffs
{
    CmuKE           0.09;
    Clrr1           1.8;
    Clrr2           0.6;
    C1              1.44;
    C2              1.83;
    Cmu             0.07;
    sigmaEps        1.15;
    sigmaK          1.0;
    CL              0.133;
    CEta            80;
    yStarLim        5;
    implicitDiv     true;
    SSG             true;
    Cg1             3.4;
    Cg1s            1.8;
    Cg2             0;
    Cg3             0.8;
    Cg3s            1.3;
    Cg4             1.25;
    Cg5             0.4;
    crossTurbDiffusion true;
    CMu             0.21;
    CSEps           0.183;
    CSR             0.21;
    SGDHEps         true;
    SGDHR           true;
    A1p             0.1;
}

//kEpsilonforHybridCoeffs
LaunderSharmaKEforHybridCoeffs
{
    //Turn on epsilon dirft term
    epsilonConsistency false;
	
    //Bounds for drift terms
    maxQk 1e8;
    minQk -1e8;
    maxQepsilon 1e8;
    minQepsilon -1e8;

}

v2fforHybridCoeffs
{
    //Turn on epsilon dirft term
   epsilonConsistency false;

    //Bounds for drift terms
    maxQk 1e8;
    minQk -1e8;
    maxQepsilon 1e8;
    minQepsilon -1e8;

    Cmu         0.22;
    CmuKEps     0.09;
    C1          1.4;
    C2          0.3;
    CL          0.23;
    Ceta        70;
    Ceps2       1.9;
    sigmaEps    1.3;
    sigmaK      1;

}


EBEVMforHybridCoeffs
{
    //Turn on epsilon dirft term
    epsilonConsistency false;

    //Bounds for drift terms
    maxQk 1e8;
    minQk -1e8;
    maxQepsilon 1e8;
    minQepsilon -1e8;

    Cmu             0.22;
    CT              4.00;
    CL              0.164;
    Ceta            75.00;
    C1              1.70;
    C2              0.90;
    sigmaPhi        1.00;
    sigmaK          1.00;
    sigmaEps        1.50;
    Ceps1           1.44;
    Ceps2           1.83;
    Ceps3           2.30;
    Ceps4           1.00;
}

// ************************************************************************* //
