RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/system/fieldAverage
fieldAverageLES
{
    // Type of functionObject
    type fieldAverage;
    
    region LES;

    // Where to load it from (if not already in solver)
    functionObjectLibs ("libfieldFunctionObjects.so");

    // Whether to perform a clean restart, or start from previous
    // averaging info if available
    cleanRestart false;

    // Whether to reset the averaged fields after they have been written.
    // Used to average over only the preceding write interval for transient
    // cases.
    resetOnOutput false;

    outputControl outputTime;

    timeStart 4000;

    // Fields to be averaged. runTime modifiable!
    fields
    (
        U
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        p
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        k
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        nuSgs
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        UEWA
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
	uprimeprime
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        epsilon
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        tauij
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        tauijEWA
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        kRANS
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        RelaxTime1
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        RelaxTime2
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        zoneWeight
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
    );
}

fieldAverageRANS
{
    // Type of functionObject
    type fieldAverage;

    region RANS;

    // Where to load it from (if not already in solver)
    functionObjectLibs ("libfieldFunctionObjects.so");

    // Whether to perform a clean restart, or start from previous
    // averaging info if available
    cleanRestart false;

    // Whether to reset the averaged fields after they have been written.
    // Used to average over only the preceding write interval for transient
    // cases.
    resetOnOutput false;

    outputControl outputTime;

    timeStart 4000;

    // Fields to be averaged. runTime modifiable!
    fields
    (
        U
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        p
        {
            mean            on;
            prime2Mean      off;
            base            time;
        }
	epsilon
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        k
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        nut
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        RelaxTime1
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        RelaxTime2
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
        zoneWeight
        {
            mean            on;
            prime2Mean      on;
            base            time;
        }
    );
}
probes11
{

type probes; // Type of functionObject
    region LES;
// Where to load it from (if not already in solver)
functionObjectLibs ("libsampling.so");
enabled         true;
outputControl   timeStep;
outputInterval  1;
probeLocations // Locations to be probed. runTime modifiable!
(
(3.0787608005 1 1.5184364492)
);
// Fields to be probed. runTime modifiable!
fields
(
U
);
}
probes12
{

type probes; // Type of functionObject
    region LES;
// Where to load it from (if not already in solver)
functionObjectLibs ("libsampling.so");
enabled         true;
outputControl   timeStep;
outputInterval  1;
probeLocations // Locations to be probed. runTime modifiable!
(
(3.0787608005 0.0166666667 1.5184364492)
);
// Fields to be probed. runTime modifiable!
fields
(
U
);
}
probes21
{
type probes; // Type of functionObject
    region RANS;
// Where to load it from (if not already in solver)
functionObjectLibs ("libsampling.so");
enabled         true;
outputControl   timeStep;
outputInterval  1;
probeLocations // Locations to be probed. runTime modifiable!
(
(3.0787608005 1 1.5184364492)
);
// Fields to be probed. runTime modifiable!
fields
(
U
);
}
probes22
{
type probes; // Type of functionObject
    region RANS;
// Where to load it from (if not already in solver)
functionObjectLibs ("libsampling.so");
enabled         true;
outputControl   timeStep;
outputInterval  1;
probeLocations // Locations to be probed. runTime modifiable!
(
(3.0787608005 0.0008 1.5184364492)
);
// Fields to be probed. runTime modifiable!
fields
(
U
);
}

