RANS_1D/RSM_OF2.1.1/395_Channel_v136meshryanchemes1mymeshRANSonlyRefEBRSM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-06;
            relTol          0;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-06;
        relTol          0.01;
        maxIter   100;
    }
    
    pFinal
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-16;
            relTol          0;
            smoother        DICGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 10;
            agglomerator    faceAreaPair;
            mergeLevels     1;
        }
        tolerance       1e-16;
        relTol          0;
        maxIter 200;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }

    R
      {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
      }

    epsilon
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-16;
       relTol          0;
    }

    epsilonh
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-16;
       relTol          0;
    }

    k
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-16;
       relTol          0;
    }

    alpha
     {
       solver          PCG;
       preconditioner  DIC;
       tolerance       1e-16;
       relTol          0;
    }

    tPhi
     {
       solver          PBiCG;
       preconditioner  DILU;
       tolerance       1e-16;
       relTol          0;
    }

    T
    {
       solver            PBiCG;
        preconditioner   DILU;
        tolerance        1;
        relTol           1;
    };
 "(U|alpha|epsilon|R)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
}

// ************************************************************************* //
